# Luminance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Luminance Property
SpecTypeId Class See Also
---
Luminance, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Luminance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Luminance As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Luminance {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace